
### :robot: Terraform Report
---
##### Plan: `8` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.rekor-monitor will be created
  + resource "digitalocean_app" "rekor-monitor" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "rekor-monitor"
          + region  = "fra"

          + database {
              + cluster_name = "app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d"
              + db_name      = "rekord-monitor-dev"
              + db_user      = "rekord-monitor-dev"
              + engine       = "PG"
              + name         = "rekord-monitor-dev"
              + production   = true
            }

          + service {
              + dockerfile_path    = "Dockerfile.grafana"
              + http_port          = 3000
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "grafana"
              + run_command        = (known after apply)
              + source_dir         = "/"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + github {
                  + branch         = "master"
                  + deploy_on_push = true
                  + repo           = "flxw/rekor-monitor"
                }
            }

          + worker {
              + dockerfile_path    = "Dockerfile"
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "rekor-crawler"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + github {
                  + branch         = "master"
                  + deploy_on_push = false
                  + repo           = "flxw/rekor-monitor"
                }
            }
        }
    }

  # digitalocean_database_cluster.postgres-cluster will be created
  + resource "digitalocean_database_cluster" "postgres-cluster" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "fra1"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "12"
    }

  # digitalocean_database_db.grafana-db will be created
  + resource "digitalocean_database_db" "grafana-db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana"
    }

  # digitalocean_database_db.monitor-db will be created
  + resource "digitalocean_database_db" "monitor-db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "rekord-monitor-dev"
    }

  # digitalocean_database_user.grafana will be created
  + resource "digitalocean_database_user" "grafana" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana-read"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_database_user.grafana-db-user will be created
  + resource "digitalocean_database_user" "grafana-db-user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana-db-user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_database_user.monitor-db-user will be created
  + resource "digitalocean_database_user" "monitor-db-user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "rekord-monitor-dev"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_vpc.default-fra1 will be created
  + resource "digitalocean_vpc" "default-fra1" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "default-fra1"
      + region     = "fra1"
      + urn        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#6291957554`](https://github.com/flxw/rekor-monitor-tf/actions/runs/6291957554) - commit 7a16337931bfd5a5704dd8341e8fa69bb417460a
